window.text1 = `"retcode":0,"code":0,"subcode":0,"type":1,"songt":0,"lyric":"[ti&#58;IF&#32;YOU]&#10;[ar&#58;BIGBANG]&#10;[al&#58;]&#10;[by&#58;]&#10;[offset&#58;0]&#10;[00&#58;00&#46;71]IF&#32;YOU&#32;&#45;&#32;BIGBANG&#32;&#40;빅뱅&#41;&#10;[00&#58;03&#46;20]词：G&#45;DRAGON&#10;[00&#58;05&#46;55]曲：G&#45;DRAGON/P&#46;K/DEE&#46;P&#10;[00&#58;09&#46;43]编曲：P&#46;K/DEE&#46;P&#10;[00&#58;11&#46;81]&#10;[00&#58;14&#46;45]그녀가&#32;떠나가요&#10;[00&#58;17&#46;48]&#10;[00&#58;21&#46;00]나는&#32;아무것도&#32;할&#32;수&#32;없어요&#10;[00&#58;24&#46;40]&#10;[00&#58;27&#46;64]사랑이&#32;떠나가요&#10;[00&#58;30&#46;94]&#10;[00&#58;33&#46;52]나는&#32;바보처럼&#32;멍하니&#32;서있네요&#10;[00&#58;38&#46;04]&#10;[00&#58;39&#46;95]멀어지는&#32;그&#32;뒷모습만을&#32;바라보다&#10;[00&#58;45&#46;13]&#10;[00&#58;46&#46;79]작은&#32;점이&#32;되어&#32;사라진다&#10;[00&#58;51&#46;91]&#10;[00&#58;54&#46;24]시간이&#32;지나면&#32;또&#32;무뎌질까&#10;[00&#58;59&#46;25]&#10;[01&#58;00&#46;06]옛&#32;생각이&#32;나&#10;[01&#58;01&#46;99]&#10;[01&#58;03&#46;37]니&#32;생각이&#32;나&#10;[01&#58;05&#46;06]&#10;[01&#58;07&#46;80]If&#32;you&#10;[01&#58;09&#46;49]&#10;[01&#58;10&#46;87]If&#32;you&#10;[01&#58;12&#46;93]&#10;[01&#58;14&#46;46]아직&#32;너무&#32;늦지&#32;않았다면&#10;[01&#58;17&#46;39]우리&#32;다시&#32;돌아갈&#32;수는&#32;없을까&#10;[01&#58;20&#46;38]&#10;[01&#58;21&#46;29]If&#32;you&#10;[01&#58;22&#46;94]&#10;[01&#58;24&#46;27]If&#32;you&#10;[01&#58;25&#46;66]&#10;[01&#58;27&#46;86]너도&#32;나와&#32;같이&#32;힘들다면&#10;[01&#58;30&#46;22]&#10;[01&#58;31&#46;01]우리&#32;조금&#32;쉽게&#32;갈&#32;수는&#32;없을까&#10;[01&#58;33&#46;75]&#10;[01&#58;35&#46;08]있을&#32;때&#32;잘할&#32;걸&#32;그랬어&#10;[01&#58;42&#46;13]&#10;[01&#58;45&#46;63]그대는&#32;어떤가요&#10;[01&#58;48&#46;61]&#10;[01&#58;52&#46;19]정말&#32;아무렇지&#32;않은&#32;건가요&#10;[01&#58;55&#46;77]&#10;[01&#58;58&#46;93]이별이&#32;지나봐요&#10;[02&#58;02&#46;80]&#10;[02&#58;04&#46;72]그댈&#32;잊어야&#32;하지만&#32;쉽지가&#32;않네요&#10;[02&#58;09&#46;14]&#10;[02&#58;11&#46;39]멀어지는&#32;그&#32;뒷모습만을&#32;바라보다&#10;[02&#58;16&#46;46]&#10;[02&#58;18&#46;28]작은&#32;점이&#32;되어&#32;사라진다&#10;[02&#58;23&#46;21]&#10;[02&#58;25&#46;64]누군갈&#32;만나면&#32;위로가&#32;될까&#10;[02&#58;30&#46;24]&#10;[02&#58;31&#46;27]옛&#32;생각이&#32;나&#10;[02&#58;33&#46;10]&#10;[02&#58;34&#46;69]니&#32;생각이&#32;나&#10;[02&#58;36&#46;28]&#10;[02&#58;38&#46;87]If&#32;you&#10;[02&#58;40&#46;68]&#10;[02&#58;42&#46;09]If&#32;you&#10;[02&#58;44&#46;27]&#10;[02&#58;45&#46;51]아직&#32;너무&#32;늦지&#32;않았다면&#10;[02&#58;48&#46;03]&#10;[02&#58;48&#46;71]우리&#32;다시&#32;돌아갈&#32;수는&#32;없을까&#10;[02&#58;51&#46;29]&#10;[02&#58;52&#46;61]If&#32;you&#10;[02&#58;54&#46;07]&#10;[02&#58;55&#46;51]If&#32;you&#10;[02&#58;57&#46;76]&#10;[02&#58;59&#46;00]너도&#32;나와&#32;같이&#32;힘들다면&#10;[03&#58;01&#46;34]&#10;[03&#58;02&#46;03]우리&#32;조금&#32;쉽게&#32;갈&#32;수는&#32;없을까&#10;[03&#58;05&#46;18]&#10;[03&#58;06&#46;31]있을&#32;때&#32;잘할&#32;걸&#32;그랬어&#10;[03&#58;13&#46;97]&#10;[03&#58;16&#46;43]오늘같이&#32;가녀린&#32;비가&#32;내리는&#32;날이면&#10;[03&#58;19&#46;75]너의&#32;그림자가&#32;떠오르고&#10;[03&#58;22&#46;15]&#10;[03&#58;23&#46;27]서랍&#32;속에&#32;몰래&#32;넣어둔&#32;우리의&#32;추억을&#10;[03&#58;26&#46;38]다시&#32;꺼내&#32;홀로&#32;회상하고&#10;[03&#58;28&#46;76]&#10;[03&#58;30&#46;02]헤어짐이란&#32;슬픔의&#32;무게를&#10;[03&#58;35&#46;76]&#10;[03&#58;36&#46;83]난&#32;왜&#32;몰랐을까&#10;[03&#58;40&#46;46]&#10;[03&#58;43&#46;18]If&#32;you&#10;[03&#58;44&#46;48]&#10;[03&#58;46&#46;28]If&#32;you&#10;[03&#58;48&#46;35]&#10;[03&#58;50&#46;08]아직&#32;너무&#32;늦지&#32;않았다면&#10;[03&#58;52&#46;23]&#10;[03&#58;52&#46;81]우리&#32;다시&#32;돌아갈&#32;수는&#32;없을까&#10;[03&#58;55&#46;37]&#10;[03&#58;56&#46;69]If&#32;you&#10;[03&#58;58&#46;26]&#10;[03&#58;59&#46;93]If&#32;you&#10;[04&#58;01&#46;75]&#10;[04&#58;03&#46;30]너도&#32;나와&#32;같이&#32;힘들다면&#10;[04&#58;06&#46;21]우리&#32;조금&#32;쉽게&#32;갈&#32;수는&#32;없을까&#10;[04&#58;09&#46;26]&#10;[04&#58;10&#46;22]있을&#32;때&#32;잘할&#32;걸&#32;그랬어"`
export class Lyric {
  constructor(el, text) {
    this.$el = el
    this.curTime = 0 //当前播放的时间
    this.$el.innerHTML = `<div class="lyric-line"></div>`
    this.$line = this.$el.querySelector('.lyric-line')
    this.index = 0 //当前歌词所在的行数
    this.text = this.formatText(text) //接口返回的歌词数据
    console.log(this.text)
    this.lyric = [] //歌词 数组
    this.resetLyric()
    console.log(this.lyric)
    this.render()
    this.start()
  }
  resetLyric() {
    if (this.text) {
      this.lyric = this.text.match(/\[\d{2}:\d{2}.\d{2}\].+/gm) //转成数组 m 多行匹配
    }
  }
  formatText(text) {
    let div = document.createElement('div')
    div.innerHTML = text
    //console.log(div.innerText)
    return div.innerText
  }
  render() {
    let html = this.lyric.map(el => `
        <div class="play-lyric-line">${el.slice(10)}</div>    
        `).join('')
    this.$line.innerHTML = html
  }
  start() {
    this.interval = setInterval(this.update.bind(this), 500)
  }
  pause() {
    clearInterval(this.interval)
  }
  update() {
    this.curTime += 0.5
    //console.log(this.lyric.length)  //找出每秒的最后一条 如 1:09 1:38 1:48则选中1：48
    if (this.index === this.lyric.length - 1) return
    for (let i = this.index + 1; i < this.lyric.length; i++) {
      let sec = this.getSec(this.lyric[i])
      //console.log(sec)
      if (
        this.curTime === sec &&
        (!this.lyric[i + 1] || this.curTime < this.getSec(this.lyric[i + 1]))
      ) {
        this.$line.children[this.index].classList.remove('active')
        this.$line.children[i].classList.add('active')
        this.index = i
        break
      }
    }
    if (this.index > 2) {
      let y = -(this.index - 2) * 42
      this.$line.style.transform = `translateY(${y}px)`
    }
  }
  getSec(line) { //每行歌词时间转成秒
    return +line.replace(/^\[(\d{2}):(\d{2}).*/, (match, p1, p2) => (+p1) * 60 + (+p2))
  } 

  reset(text){
    this.pause()
    this.index = 0
    this.curTime = 0
    this.$line.style.transform = `translateY(0)`
    let $active = this.$line.querySelector('.active')
    if ($active) {
      $active.classList.remove('active')
    }
    if(text) {
      this.text = this.formatText(text)
      this.resetLyric()
      if(this.lyric.length) this.render()
    }
     if (this.lyric.length) {
       this.$line.children[this.index].classList.add('active')
     }
  }
  restart(){
    this.reset()
    this.start()
  }
}

 